performance_scripts/refinement/Prompt_1/gpt_2/user_registration_performance_test_fixed_jmeter_5_6_3.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="User Registration Performance Test - /api/v1/users/register">
      <stringProp name="TestPlan.comments">Validate the User Registration endpoint performance under concurrent load, ensuring p95 response time, error rate, and throughput meet NFR targets while simulating up to 100 concurrent users.</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">BASE_PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_USERS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_USERS</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">PASSWORD</stringProp>
            <stringProp name="Argument.value">StrongP@ssword!</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Setup - Initialize Metrics">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Initialize Metrics">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">
import java.util.concurrent.ConcurrentLinkedQueue
import java.util.concurrent.atomic.AtomicLong
import java.util.concurrent.atomic.LongAdder
props.put(&apos;reg.total&apos;, new LongAdder())
props.put(&apos;reg.errors&apos;, new LongAdder())
props.put(&apos;reg.times&apos;, new ConcurrentLinkedQueue&lt;Long&gt;())
props.put(&apos;reg.firstSampleTs&apos;, new AtomicLong(0L))
props.put(&apos;reg.lastSampleTs&apos;, new AtomicLong(0L))
SampleResult.setSuccessful(true)
SampleResult.setResponseCode(&apos;200&apos;)
SampleResult.setResponseMessage(&apos;Metrics initialized&apos;)
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Ramp Up - 100 Concurrent Users for 300s">
        <stringProp name="ThreadGroup.num_threads">${TARGET_USERS}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${BASE_PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Unique Registration Data" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">
def ts = System.currentTimeMillis()
def rand = UUID.randomUUID().toString().replace(&apos;-&apos;, &apos;&apos;).substring(0, 12)
vars.put(&apos;reg_username&apos;, &quot;test_user${ts}_${ctx.getThreadNum()}_${rand}&quot;)
vars.put(&apos;reg_email&apos;, &quot;test${ts}_${ctx.getThreadNum()}_${rand}@example.com&quot;)
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/users/register">
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">http://localhost:8080//api/v1/users/register</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;username&quot;: &quot;${reg_username}&quot;,&#xd;
  &quot;email&quot;: &quot;${reg_email}&quot;,&#xd;
  &quot;password&quot;: &quot;${PASSWORD}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert HTTP 2xx" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
def rc = prev.getResponseCode()
if (!(rc ==~ /2\d\d/)) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Expected HTTP 2xx but got ${rc}&quot;)
}
            </stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Aggregate Registration Metrics" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
import java.util.concurrent.atomic.AtomicLong
import java.util.concurrent.atomic.LongAdder
LongAdder total = props.get(&apos;reg.total&apos;) as LongAdder
LongAdder errors = props.get(&apos;reg.errors&apos;) as LongAdder
def times = props.get(&apos;reg.times&apos;)
AtomicLong firstTs = props.get(&apos;reg.firstSampleTs&apos;) as AtomicLong
AtomicLong lastTs = props.get(&apos;reg.lastSampleTs&apos;) as AtomicLong
long sampleStart = prev.getStartTime()
long sampleEnd = prev.getEndTime()
total.increment()
if (!prev.isSuccessful()) { errors.increment() }
times.add(prev.getTime() as Long)
while (true) {
  long cur = firstTs.get()
  if (cur != 0L &amp;&amp; cur &lt;= sampleStart) { break }
  if (firstTs.compareAndSet(cur, sampleStart)) { break }
}
while (true) {
  long cur = lastTs.get()
  if (cur &gt;= sampleEnd) { break }
  if (lastTs.compareAndSet(cur, sampleEnd)) { break }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="TearDown - Validate NFRs">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Evaluate NFRs">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">
import java.util.concurrent.atomic.AtomicLong
import java.util.concurrent.atomic.LongAdder
LongAdder total = props.get(&apos;reg.total&apos;) as LongAdder
LongAdder errors = props.get(&apos;reg.errors&apos;) as LongAdder
def queue = props.get(&apos;reg.times&apos;)
AtomicLong firstTs = props.get(&apos;reg.firstSampleTs&apos;) as AtomicLong
AtomicLong lastTs = props.get(&apos;reg.lastSampleTs&apos;) as AtomicLong
long totalCount = total != null ? total.sum() : 0L
long errorCount = errors != null ? errors.sum() : 0L
def times = []
if (queue != null) { times.addAll(queue) }
Collections.sort(times)
long p95 = 0L
if (times.size() &gt; 0) {
  int index = Math.ceil(times.size() * 0.95d) as int
  index = Math.max(1, index) - 1
  p95 = (times[index] as Number).longValue()
}
long first = firstTs != null ? firstTs.get() : 0L
long last = lastTs != null ? lastTs.get() : 0L
double elapsedSec = (first &gt; 0L &amp;&amp; last &gt; first) ? ((last - first) / 1000.0d) : 0.0d
double throughput = elapsedSec &gt; 0 ? (totalCount / elapsedSec) : 0.0d
double errorRate = totalCount &gt; 0 ? (errorCount * 100.0d / totalCount) : 100.0d
boolean p95Pass = p95 &lt;= 500L
boolean errorPass = errorRate &lt; 1.0d
boolean throughputPass = throughput &gt;= 150.0d
def summary = &quot;&quot;&quot;NFR Evaluation Summary
total_samples=${totalCount}
error_count=${errorCount}
error_rate_pct=${String.format(&apos;%.4f&apos;, errorRate)}
p95_ms=${p95}
throughput_rps=${String.format(&apos;%.4f&apos;, throughput)}
threshold_p95_ms&lt;=500 =&gt; ${p95Pass}
threshold_error_rate_pct&lt;1 =&gt; ${errorPass}
threshold_throughput_rps&gt;=150 =&gt; ${throughputPass}
&quot;&quot;&quot;
log.info(summary)
SampleResult.setResponseData(summary, &apos;UTF-8&apos;)
if (totalCount == 0L) {
  SampleResult.setSuccessful(false)
  SampleResult.setResponseCode(&apos;500&apos;)
  SampleResult.setResponseMessage(&apos;No samples were collected&apos;)
  throw new AssertionError(&apos;No samples were collected for /api/v1/users/register&apos;)
}
if (!(p95Pass &amp;&amp; errorPass &amp;&amp; throughputPass)) {
  SampleResult.setSuccessful(false)
  SampleResult.setResponseCode(&apos;500&apos;)
  SampleResult.setResponseMessage(&apos;NFR validation failed&apos;)
  throw new AssertionError(summary)
}
SampleResult.setSuccessful(true)
SampleResult.setResponseCode(&apos;200&apos;)
SampleResult.setResponseMessage(&apos;All NFR thresholds passed&apos;)
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>